# 4.1.1 문자열 출력
print("Hello world")  # Hello world
print('Hello world')  # Hello world

# 4.1.2 파이썬의 용도
# 웹 애플리케이션 제작 : 장고, 플라스크
# 과학 기술 계산 및 데이터 분석용 언어. 파이썬 이외에 R, MATLAB 등도 있으나 인공지능, 머신런이 분야에서는 파이썬이 가장 많이 사용됨
# 파이썬 IDE : PyCharm, Atom, Sublime Text, JupyterNotebook
# (주피터 노트북은 데이터가 메모리에 유지되며 데이터 처리 로그를 노트로 남길 수 있기 때문에 데이터 전처리에 많이 사용)

# 4.1.3 주석, comment 입력
# 3+8의 결과를 출력합니다.
print(3 + 8)  # 11


# 4.1.4 숫자와 문자열
# 숫자의 경우 "" 또는 '' 로 묶을 필요가 없다.
# () 안에 계산식을 대입하면 계산 결과가 출력된다.
print(3 + 6)  # 9
print("3 + 6")  # 3+6


# 문제
print(18)  # 18
print(2 + 6)  # 8
print('2 + 6')  # 2+6


# 4.1.5 연산자
# 파이썬에서는 기본적인 계산을 할 수 있다.
# 사칙 연산뿐만 아니라 지수 게산과 나눗셈의 나머지 계산도 가능하다.
# +와 - 등을 산술 연산자라고 한다.

# 문제
print(3 + 5)  # 8
print(3 - 5)  # -2
print(3 * 5)  # 15
print(3 / 5)  # 0.6
print(3 % 5)  # 3
print(3 ** 5)  # 243
