# 01-1 python이란?
# python은 1990년 암스테르담의 귀도 반 로섬(Guido Van Rossum)이 개발한 인터프리터 언어이다
# 귀도는 파이썬이라는 이름을 자신이 좋아하는 코미디 쇼인 "몬티 파이썬의 날아다니는 서커스(Monty Python's Flying Circus)" 에서 따왔다고 한다

# 인터프리터 언어란 한 줄씩 소스 코드를 해석해서 그때그때 실행해 결과를 바로 확인할 수 있는 언어이다

# python의 사전적 의미는 고대 신화에 나오는 파르나소스 산의 동굴에 살던 큰 뱀을 뜻하며
# 아폴로 신의 델파이에서 파이썬을 퇴치했다는 이야기가 전해지고 있다

# 01-2 python의 특징
# 1) 파이썬은 인간다운 언어이다
# 프로그래밍이란 인간이 생각하는 것을 컴퓨터에 지시하는 행위라고 할 수 있다
# 파이썬은 사람이 생각하는 방식을 그대로 표현할 수 있는 언어이다
# 따라서 프로그래머는 굳이 컴퓨터의 사고 체계에 맞추어서 프로그래밍을 하려고 애쓸 필요가 없다

# 2) 파이썬은 문법이 쉬워 빠르게 배울 수 있다

# 3) 파이썬은 무료이지만 강력하다
# 파이썬은 오픈소스로서 무료이다 
# 오픈 소스란 저작권자가 소스 코드를 공개해 누구나 별다른 제한 없이 자유롭게 사용, 복제, 배포, 수정할 수 있는 소프트웨어이다
# 또한 프로그래머는 만들고자 하는 프로그램의 대부분을 파이썬으로 만들 수 있다
# 물론 시스템 프로그래밍이나 하드웨어 제어와 같은 매우 복잡하고 반복 연산이 많은 프로그램은 파이썬과 어울리지 않는다
# 하지만 파이썬은 이러한 약점을 극복할 수 있게끔 다른 언어로 만든 프로그램을 파이썬 프로그램에 포함시킬 수 있다
# 파이썬과 C는 찰떡궁합이란 말이 있다
# 즉 프로그램의 전반적인 뼈대는 파이썬으로 만들고 빠른 실행 속도가 필요한 부분은 C로 만들어서 파이썬 프로그램 안에 포함시키는 것이다
# 사실 파이썬 라이브러리 중에는 순수 파이썬으로 제작된 것도 많지만 C로 만든 것도 많다
# C로 만든 것 대부분 속도가 빠르다
# 파이썬 라이브러리란 파이썬 프로그램을 작성할 때 불러와 사용할 수 있는 미리 만들어 놓은 파이썬 파일 모음이다

# 4) 파이썬은 간결하다
languages = ['python', 'perl', 'c', 'java']

for lang in languages:
    if lang in ['python', 'perl']:
        print("%6s need interpreter" % lang)
    elif lang in ['c', 'java']:
        print("%6s need compiler" % lang)
    else:
        print("should not reach here")

# 파이썬 프로그램은 줄을 맞추지 않으면 실행되지 않는다
# 줄을 맞추어 코드를 작성하는 행위는 가독성에 크게 도움이 된다
# 이렇게 코드의 줄을 맞추는 것을 "들여쓰기"라고 부른다
# 파이썬에서는 들여쓰기를 하지 않으면 프로그램이 실행되지 않는다

# 5) 파이썬은 프로그래밍을 즐기게 해 준다

# 6) 파이썬은 개발 속도가 빠르다
# Life is too short, You need python
